content/teaching/2025_games_graphs_and_machines/index.org
# Created 2026-02-24 Tue 16:59
#+options: toc:nil ':t tags:nil prop:nil ":t
#+title: Games, graphs, and machines
#+subtitle: {{{COURSENUM}}}, {{{SEMESTER}}}
#+startup: noptag overview
#+filetags: teaching ggm
#+latex_class: amsart
#+latex_header: \usepackage{fullpage} \usepackage[charter, cal=cmcal]{mathdesign} \usepackage{environ} \usepackage{multicol} \usepackage{mathabx}
#+latex_header: \usepackage{mdframed} \usepackage{svg} \usepackage{tikz}
#+latex_header: \usepackage{etoolbox} \newtoggle{solutions} \togglefalse{solutions}
#+latex_header: \usepackage{enumitem}
#+latex_header: \usepackage{setspace}
#+latex_header: \NewEnviron{solution}{\iftoggle{solutions}{\vspace{1em}\begin{mdframed}\begin{proof}[Solution]\BODY\end{proof}\end{mdframed}\vspace{1em}}{}}
#+latex_header: \NewEnviron{workbox}{\iftoggle{solutions}{}{\vspace{1em}\begin{mdframed}\BODY\end{mdframed}\vspace{1em}}}
#+latex_header: \usepackage{skull}
#+latex_header: \usetikzlibrary{arrows,automata,positioning}
#+latex_compiler: pdflatex
#+export_file_name: ~/website/content/teaching/2025_games_graphs_and_machines/index.org
#+archive: %s_archive::
:COURSE_INFO:
#+macro: SEMESTER Semester 2, 2025
#+macro: COURSENUM MATH2301
:END:

These are the course materials for MATH2301 /Games, graphs, and machines/ as taught at the ANU in 2025.
* Course information
*** What is the course about?

The goal of the course is to get hands-on experience in mathematical thinking.
The course consists of four parts, of roughly equal duration:

1. Foundations:  The basic vocabulary of modern mathematics (sets, functions, and relations).
2. Graph theory: Graphs as a tool to model relations; graphs and matrices; applications to path finding.
3. Regular expressions and automata: Finite state machines; pattern recognition; regular expressions; limits of mechanical pattern recogntion.
4. Combinatorial games: Using graphs to model and analyse adversarial interactions; winning strategies.

Our main reference will be [[https://canvas.anu.edu.au/files/715877/][course notes written by me and my colleague Asilata Bapat]].
In these notes are references to other supplementary materials.
** What will we do each week?
Each week, we will have the following activities:

1. Pre-lecture videos and reading (to be done before the Monday lecture)
2. Lectures (Monday 12pm-1pm, Tuesday 1pm-2pm, and Wed 3pm-4pm)
3. Workshop (Thursday or Friday)
4. Homework (due by the end of Friday)
5. Reflective check-in (due by the end of Friday)
**** What are pre-lecture videos?
Can you follow mathematical definitions and theorems in real time?  I certainly cannot.  I need to digest them at my own pace.  Having recognised this, I will make short videos (5-10 min) about the key concepts every week.  I will assume that you have watched these videos when you come to lectures, and have had some time to mull them over.  I will also post the reading from the book well in advance, so that you have time to give it a quick read before coming to lectures.  

If you have basic familiarity with the material before coming to lecture, it allows us to go into trickier details and examples and more lively discussions in class.  
**** What are reflective check-ins?
Every week, I will ask you to provide short feedback about the material of the week (< 2 min).  It will help me adjust the pace and level.  It will also give you a chance to reflect on your learning.  There are no right or wrong answers here.  As long as you complete the feedback, you get full points.
**** Do we have to come to lectures?
You should!\(\tiny{\textrm{Although, technically you do not have to}}\).  Lectures are a great place to work through the key ideas, ask questions, and meet other students.  Also, remember that on Wednesdays, we have an in-class quiz.
**** Do we have to go to workshops?
Yes.  Remember---mathematics is not a spectator sport.  You can't learn if you don't do it yourself.  And workshops are the place where you do the maths.  Also, active engagement in the workshops is worth points.

Sign up for workshops using [[https://services.anu.edu.au/information-technology/software-systems/mytimetable][MyTimetable]].
The workshops will be one hour long, but the demonstrators will be available for half an hour after the workshop for consultation.
*** What is the assessment?
The final mark in the course will be based on:

1. Reflective check-ins (5%)
2. Workshop engagement (5%)
3. Quizzes (0 to 20%)
4. Homework (30%)
5. Final exam (40 to 60%)

The quizzes will be in class on Wednesday.
If you do not take them, their weight for the overall mark will be absorbed in the final exam.
Precisely, if you take \(n\%\) of the quizzes, your quiz scores will weigh \((n/5)\%\) and your final exam will weigh \((60-n/5)\%\).
* Home page
Welcome to /Games, Graphs, and Machines/, where we use maths to analyse patterns, bots, and games.
Visit the [[https://canvas.anu.edu.au/courses/2640/pages/course-information][course information page]] for an overview of the course.
