teaching/2025_games_graphs_and_machines/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-25 Sat 12:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Games, graphs, and machines</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"><link href="https://fonts.googleapis.com/css2?family=Atkinson+Hyperlegible:ital,wght@0,400;0,700;1,400;1,700&family=B612:wght@300..700&display=swap" rel="stylesheet">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Games, graphs, and machines
<br />
<span class="subtitle">MATH2301, Semester 2, 2025</span>
</h1>
<p>
These are the course materials for MATH2301 <i>Games, graphs, and machines</i> as taught at the ANU in 2025.
</p>
<div id="outline-container-org72e351e" class="outline-2">
<h2 id="org72e351e">Course information</h2>
<div class="outline-text-2" id="text-org72e351e">
</div>
<div id="outline-container-orge230af9" class="outline-4">
<h4 id="orge230af9">What is the course about?</h4>
<div class="outline-text-4" id="text-orge230af9">
<p>
The goal of the course is to get hands-on experience in mathematical thinking.
The course consists of four parts, of roughly equal duration:
</p>

<ol class="org-ol">
<li>Foundations:  The basic vocabulary of modern mathematics (sets, functions, and relations).</li>
<li>Graph theory: Graphs as a tool to model relations; graphs and matrices; applications to path finding.</li>
<li>Regular expressions and automata: Finite state machines; pattern recognition; regular expressions; limits of mechanical pattern recogntion.</li>
<li>Combinatorial games: Using graphs to model and analyse adversarial interactions; winning strategies.</li>
</ol>

<p>
Our main reference will be <a href="https://canvas.anu.edu.au/files/715877/">course notes written by me and my colleague Asilata Bapat</a>.
In these notes are references to other supplementary materials.
</p>
</div>
</div>
<div id="outline-container-orge794656" class="outline-3">
<h3 id="orge794656">What will we do each week?</h3>
<div class="outline-text-3" id="text-orge794656">
<p>
Each week, we will have the following activities:
</p>

<ol class="org-ol">
<li>Pre-lecture videos and reading (to be done before the Monday lecture)</li>
<li>Lectures (Monday 12pm-1pm, Tuesday 1pm-2pm, and Wed 3pm-4pm)</li>
<li>Workshop (Thursday or Friday)</li>
<li>Homework (due by the end of Friday)</li>
<li>Reflective check-in (due by the end of Friday)</li>
</ol>
</div>
<ul class="org-ul">
<li><a id="orgd720a29"></a>What are pre-lecture videos?<br />
<div class="outline-text-5" id="text-orgd720a29">
<p>
Can you follow mathematical definitions and theorems in real time?  I certainly cannot.  I need to digest them at my own pace.  Having recognised this, I will make short videos (5-10 min) about the key concepts every week.  I will assume that you have watched these videos when you come to lectures, and have had some time to mull them over.  I will also post the reading from the book well in advance, so that you have time to give it a quick read before coming to lectures.  
</p>

<p>
If you have basic familiarity with the material before coming to lecture, it allows us to go into trickier details and examples and more lively discussions in class.  
</p>
</div>
</li>
<li><a id="orgbebe36d"></a>What are reflective check-ins?<br />
<div class="outline-text-5" id="text-orgbebe36d">
<p>
Every week, I will ask you to provide short feedback about the material of the week (&lt; 2 min).  It will help me adjust the pace and level.  It will also give you a chance to reflect on your learning.  There are no right or wrong answers here.  As long as you complete the feedback, you get full points.
</p>
</div>
</li>
<li><a id="orgc5376af"></a>Do we have to come to lectures?<br />
<div class="outline-text-5" id="text-orgc5376af">
<p>
You should!\(\tiny{\textrm{Although, technically you do not have to}}\).  Lectures are a great place to work through the key ideas, ask questions, and meet other students.  Also, remember that on Wednesdays, we have an in-class quiz.
</p>
</div>
</li>
<li><a id="org7493c5c"></a>Do we have to go to workshops?<br />
<div class="outline-text-5" id="text-org7493c5c">
<p>
Yes.  Remember&#x2014;mathematics is not a spectator sport.  You can&rsquo;t learn if you don&rsquo;t do it yourself.  And workshops are the place where you do the maths.  Also, active engagement in the workshops is worth points.
</p>

<p>
Sign up for workshops using <a href="https://services.anu.edu.au/information-technology/software-systems/mytimetable">MyTimetable</a>.
The workshops will be one hour long, but the demonstrators will be available for half an hour after the workshop for consultation.
</p>
</div>
</li>
</ul>
<div id="outline-container-orgceef609" class="outline-4">
<h4 id="orgceef609">What is the assessment?</h4>
<div class="outline-text-4" id="text-orgceef609">
<p>
The final mark in the course will be based on:
</p>

<ol class="org-ol">
<li>Reflective check-ins (5%)</li>
<li>Workshop engagement (5%)</li>
<li>Quizzes (0 to 20%)</li>
<li>Homework (30%)</li>
<li>Final exam (40 to 60%)</li>
</ol>

<p>
The quizzes will be in class on Wednesday.
If you do not take them, their weight for the overall mark will be absorbed in the final exam.
Precisely, if you take \(n\%\) of the quizzes, your quiz scores will weigh \((n/5)\%\) and your final exam will weigh \((60-n/5)\%\).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org709fcec" class="outline-2">
<h2 id="org709fcec">Home page</h2>
<div class="outline-text-2" id="text-org709fcec">
<p>
Welcome to <i>Games, Graphs, and Machines</i>, where we use maths to analyse patterns, bots, and games.
Visit the <a href="https://canvas.anu.edu.au/courses/2640/pages/course-information">course information page</a> for an overview of the course.
</p>
</div>
