content/teaching/2025_games_graphs_and_machines/index.org
** Week by week
- Week 1
  - Watch: [[https://canvas.anu.edu.au/files/704425][Sets]], [[https://canvas.anu.edu.au/files/704426][Functions]], [[https://canvas.anu.edu.au/files/704427][Relations]]
  - Read: /Some foundations/ from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/706185/download?download_frd=1&verifier=oH0NrvZ7LbdvqBTLCREnQieT56jtJVyT0qgmxrxc][Monday]] ([[https://canvas.anu.edu.au/files/706185/download?download_frd=1&verifier=oH0NrvZ7LbdvqBTLCREnQieT56jtJVyT0qgmxrxc][annotated]]), [[https://canvas.anu.edu.au/files/707643/download?download_frd=1&verifier=Ccbb9TJyYV7iqgvDuWwHJLkjmU8ES6gfsvGGjNpA][Tuesday]] ([[https://canvas.anu.edu.au/files/709624/download?download_frd=1&verifier=ilS5t91IGkqJTyF0PJ24H2Tw11Aor8vFwpWSUJwM][annotated]]), [[https://canvas.anu.edu.au/files/709623/download?download_frd=1&verifier=FLp3XgnYWV6lZ5Kn1qCY0FJ7CC34czJ5J8yjlO5V][Wednesday]] ([[https://canvas.anu.edu.au/files/709622/download?download_frd=1&verifier=86i1plXUX4ANR6PiOZZelkUEvMXaoY16NBLPTwLT][annotated]])
- Week 2
  - Watch: [[https://canvas.anu.edu.au/files/706765][Equivalence relations]], [[https://canvas.anu.edu.au/files/706767][Modular arithmetic]]
  - Read: /Equivalence relations/ from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/709890/download?download_frd=1&verifier=RmLFJ3uhBGI4m8RlXGPr2BhC8ejjpGmaz3ZypFZx][Assignment 1 (due 1 Aug)]] ([[https://canvas.anu.edu.au/files/733279/download?download_frd=1&verifier=oqhBYwaOkWepdASEvBKakyzbq7Aw7Sgglbf7JZK6][solutions]]), [[https://canvas.anu.edu.au/files/715135/download?download_frd=1&verifier=qZXMO7vBnxUkyQ70jQuHX7l3bPelONzvtQ8YBjHt][Worksheet 1]] ([[https://canvas.anu.edu.au/files/733257/download?download_frd=1&verifier=TkxTB474Whc3QcrPZw0SjxbGRauTW1tTwORZKUZT][solutions]]), [[https://canvas.anu.edu.au/files/722147/download?download_frd=1&verifier=Mc76QZ7klU5HTpW5UO7QvdOn1eRHnQnNnnF59jUx][Quiz 1]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/714010/download?download_frd=1&verifier=0WY1jaaGyOqsOWxJ3hcg6soQFGxwdmUIlnbJTN0y][Monday]] ([[https://canvas.anu.edu.au/files/714356/download?download_frd=1&verifier=U2t8WWc8FGTK5Met5YLij1vTFTIGawpd7SD5IBYc][annotated]]), [[https://canvas.anu.edu.au/files/716040/download?download_frd=1&verifier=OPLsHOtvQCsLVbx3I5drnUDqtLSfO8Ckku6lMmaS][Tuesday]] ([[https://canvas.anu.edu.au/files/716417/download?download_frd=1&verifier=3NzroizrXy9zukJslGlMvCdbXHWL0VLeFqpl4LF2][annotated]]), [[https://canvas.anu.edu.au/files/717637/download?download_frd=1&verifier=pB12NNkHDf69ATESH3GauZkWUjbfHfeBVuOl9cGS][Wednesday]] ([[https://canvas.anu.edu.au/files/718982/download?download_frd=1&verifier=8gztB3x343SEQYnjk2fY7IvLYCI7h186WJG4RmNe][annotated]])
- Week 3
  - Watch: [[https://canvas.anu.edu.au/files/718976/][Partial orders 1]], [[https://canvas.anu.edu.au/files/718978/][Partial orders 2]]
  - Read: /Partial orders/ from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/718708/download?download_frd=1&verifier=JeNveCoSBY6ztZLjQGgjaNK46uhhilohTM9MpozY][Assignment 2 (due 8 Aug)]] ([[https://canvas.anu.edu.au/files/744924/download?download_frd=1&verifier=rYYaIEtdfo4AveQUNF5b9ns6tPAxDV1YUtnt9Ss0][solutions]]), [[https://canvas.anu.edu.au/files/725876/download?download_frd=1&verifier=F9bBqZbuIucG20baWB5Z337sZiAJbqGTaayBUX1d][Worksheet 2]] ([[https://canvas.anu.edu.au/files/738776/download?download_frd=1&verifier=eA2jRWwJZqkeQRrJPpBiTsyrJaN6EAAhwCT4lJZj][solutions]]), [[https://canvas.anu.edu.au/files/738771/download?download_frd=1&verifier=Saz6eNl3kgVVzGr7SNM8uVwv5w5fYzpVkO7qsIse][Quiz 2]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/725255/download?download_frd=1&verifier=YE9JHHoVeftWsD0gX1pWAbCcnTrpryrlMPzjMlFw][Monday]] ([[https://canvas.anu.edu.au/files/725880/download?download_frd=1&verifier=Dpns8Ku8uLUa3Q4VYGX4FzfMVpauTOxAB4bj7AjA][annotated]]), [[https://canvas.anu.edu.au/files/727029/download?download_frd=1&verifier=0yYSm021GYCdzlQnvqLIi6dtA4xfSrpo8662ca44][Tuesday]] ([[https://canvas.anu.edu.au/files/727605/download?download_frd=1&verifier=5Rp5zFE3UVk3A6nILOrJ6d1OKywH66DXeLVtCLI2][annotated]]), [[https://canvas.anu.edu.au/files/729550/download?download_frd=1&verifier=4O7ovTF6wKKqfIvS0D0XED45EANmjFs5o2DdsuqU][Wednesday]] ([[https://canvas.anu.edu.au/files/730392/download?download_frd=1&verifier=B5YLkwrbhpf5GYzuvkXG6UKoXa8kIwrUxngiyRcw][annotated]])
- Week 4
  - Watch: [[https://canvas.anu.edu.au/files/725257/][Graphs and adjacency matrices]], [[https://canvas.anu.edu.au/files/725259/][matrices]]
  - Read: /Graphs/ from  [[https://canvas.anu.edu.au/files/715877/][the book]] (up to /Counting paths using the adjacency matrix/)
  - Solve: [[https://canvas.anu.edu.au/files/729999/download?download_frd=1&verifier=cW8gGsD5kfHF3oSH7eJqXL2vMCC3xyCR32xW89ht][Assignment 3 (due 15 Aug)]] ([[https://canvas.anu.edu.au/files/764458/download?download_frd=1&verifier=BgWBMUmAb5ztfyE5zo8uz858MeXsYyPuAMqIzidm][solutions]]), [[https://canvas.anu.edu.au/files/741497/download?download_frd=1&verifier=NNABH8I4s7UNE1LPuf8YteHPFmwTGhZOuEO76dib][Worksheet 3]] ([[https://canvas.anu.edu.au/files/757549/download?download_frd=1&verifier=nmQVYDUpzcXuuWTWaUWdwIoZQ4P9P4I62wKUurY3][solutions]]), [[https://canvas.anu.edu.au/files/761355/download?download_frd=1&verifier=Xi0SYGFQQ8TwRCcsC3McYRFCtzsFHtl5SmYHq0Xm][Quiz 3]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/738826/download?download_frd=1&verifier=O0a5JS1uWpqjlSMcf2WEdw7AHzqiqs1YM7EMSAse][Monday]] ([[https://canvas.anu.edu.au/files/741827/download?download_frd=1&verifier=yFhizS6oN2fyvk5sDL31luTQzKUYfmBvVa1bwROA][annotated]]), [[https://canvas.anu.edu.au/files/741822/download?download_frd=1&verifier=W6AmpTIhyvP8bRe7qKqSaW74IONby8c7MRH4WNBX][Tuesday]] ([[https://canvas.anu.edu.au/files/744155/download?download_frd=1&verifier=YJdMAbY8MPYtVxF0FU3SUwbS8BaEqSloaX60sgQ5][annotated]]), [[https://canvas.anu.edu.au/files/744163/download?download_frd=1&verifier=psr6ionkJZrCXuwjSZnY2d93QrgezAxanh7hCwuI][Wednesday]] ([[https://canvas.anu.edu.au/files/752099/download?download_frd=1&verifier=Ni3txTpLB9rnJgfmSC5KHSfsVqw3UE31l77LfbP5][annotated]])
- Week 5
  - Watch: [[https://canvas.anu.edu.au/files/738751/][Paths (counting and existence)]], [[https://canvas.anu.edu.au/files/738753/][Shortest paths]]
  - Read: /Graphs/ from [[https://canvas.anu.edu.au/files/715877/][the book]] (up to /Shortest paths using min-plus arithmetic/).
  - Solve: [[https://canvas.anu.edu.au/files/745075/download?download_frd=1&verifier=RGvc4NJGOQv5JgYcvHk2vQL4gBt475FgvOPC1T86][Assignment 4 (due 22 Aug)]] ([[https://canvas.anu.edu.au/files/791417/download?download_frd=1&verifier=48I1gzK1PZ7G2uqtnL4tpv3JqCcQiB0R7grdJVOq][solutions]]), [[https://canvas.anu.edu.au/files/759184/download?download_frd=1&verifier=NDB68ZlBP5WXOG0JFYSiO9PKjub9wfUZnuoyLyW2][Worksheet 4]] ([[https://canvas.anu.edu.au/files/778182/download?download_frd=1&verifier=gAQIyeF4ImaGOlTf5HxuVyOjouENuKUpviqqhWgu][solutions]]), [[https://canvas.anu.edu.au/files/778198/download?download_frd=1&verifier=PjQZH2EaKKdTPrpcGrN2tmFhQM5F4oqHyVoYWLk3][Quiz 4]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/757619/download?download_frd=1&verifier=P9AIty2E3JQRDKOzuM5ZsD6kNrtNeVX2dr8J4Bi1][Monday]] ([[https://canvas.anu.edu.au/files/761361/download?download_frd=1&verifier=SZIIghUM1yr93sh54AtYfzv5D2EDUrSEKYJWP4Bb][annotated]]), [[https://canvas.anu.edu.au/files/761403/download?download_frd=1&verifier=iA6E7Hn6xRWg5sxBSPzlympFV4pYq8JCpEO6yns5][Tuesday]] ([[https://canvas.anu.edu.au/files/764145/download?download_frd=1&verifier=BJopiMBcsTppeSCQtTBXSz2dwZjdIKcL6JI8Ecjj][annotated]]), [[https://canvas.anu.edu.au/files/764149/download?download_frd=1&verifier=crBzYASBlMeoFkmsvfICW0QZxCfYMhaMwZ759lgV][Wednesday]] ([[https://canvas.anu.edu.au/files/766553/download?download_frd=1&verifier=wU7U8fiVgLOZPaCJLnmM1oXBJ8FkMx0V5u2ycmiE][annotated]])
- Week 6
  - Watch: [[https://canvas.anu.edu.au/files/757565/][Markov chains]], [[https://canvas.anu.edu.au/files/757569/][Computing large powers]]
  - Read: /Graphs/ from [[https://canvas.anu.edu.au/files/715877/][the book]] (Markov chains, Computing large powers)
  - Solve: [[https://canvas.anu.edu.au/files/766550/download?download_frd=1&verifier=hIrzRPTCuNXvHSfwvI9Pyqb769uPvMQN6TPHyyed][Assignment 5 (due 29 Aug)]] ([[https://canvas.anu.edu.au/files/831136/download?download_frd=1&verifier=3OFCtsBt88g1sijZ97fUic7wl55HLXVyKEG9KiNb][solutions]]), [[https://canvas.anu.edu.au/files/779144/download?download_frd=1&verifier=3548NOHUS1N7zmv2BYsn0H8SxILPzhvTMALide17][Worksheet 5]] ([[https://canvas.anu.edu.au/files/847725/download?download_frd=1&verifier=KveqL5tvm1iBWGr0a6FPmpvg0QG04NCuKhjevWqw][solutions]]), [[https://canvas.anu.edu.au/files/847946/download?download_frd=1&verifier=wfv6aQrbvmhQAz4zlucmJqQqWL3xN7YycBYkmxVv][Quiz 5]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/778295/download?download_frd=1&verifier=nUjl6E1VwIPzjWArDBzpbDM23HQv7hCSxg4KiM42][Monday]] ([[https://canvas.anu.edu.au/files/781990/download?download_frd=1&verifier=AOIEwlDaSAv4ZXNC3e4YOXdPXJyijwuZWzpBYbM8][annotated]]), [[https://canvas.anu.edu.au/files/781989/download?download_frd=1&verifier=OhPbe8UsP9Bk9IedJLmWMPgpkOCGfafEkPQvyvZt][Tuesday]] ([[https://canvas.anu.edu.au/files/784988/download?download_frd=1&verifier=DrYvbJJzG86ijjbd571ADgR2lce4WpMVjz9LZXu2][annotated]]), [[https://canvas.anu.edu.au/files/784984/download?download_frd=1&verifier=L6GKxF4dW2BgCL1BF5A7I3UJFm8ivSEYjs8P4oOc][Wednesday]] ([[https://canvas.anu.edu.au/files/791422/download?download_frd=1&verifier=OSqK4uZ1GXVRrVQMFL2agNF8kUUwMdjU5XOL0DQU][annotated]])
- Week 7
  - Watch: [[https://canvas.anu.edu.au/files/812083/][Alphabets, strings, languages]]; [[https://canvas.anu.edu.au/files/812084/][regular expressions]]; [[https://canvas.anu.edu.au/files/812086/][deterministic finite automata]]
  - Read: /Regular expressions and finite automata/ (up to deterministic finite automata) from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/816336/download?download_frd=1&verifier=zzO377BXRRhK7pRZ1ryBWSLsvrt6pyxFieDq0Fei][Assignment 6 (due 19 Sep)]] ([[https://canvas.anu.edu.au/files/857925/download?download_frd=1&verifier=pS5pqwHGJ8bEWXihZQFLBbNR6dWOvHxymFtUu8Ef][solutions]]), [[https://canvas.anu.edu.au/files/828520/download?download_frd=1&verifier=OgBkNdBBIjIjoKKZ8pzl1lCAsxtiVj64YrXlKABV][Worksheet 6]] ([[https://canvas.anu.edu.au/files/847728/download?download_frd=1&verifier=zxR4bgdnFKv3pZDB5qYfTjd31lbpyul1lQ3mGzEO][solutions]]), [[https://canvas.anu.edu.au/files/866126/download?download_frd=1&verifier=svQh2A2xUQdOmC9ns5pl5yDZObJIB6VPDdAK4J5G][Quiz 6]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/824398/download?download_frd=1&verifier=COgDTbvk3yYSKYbrHti95qIMZfc7kTBMU0XU9cLQ][Monday]] ([[https://canvas.anu.edu.au/files/829746/download?download_frd=1&verifier=72GxVeJ8GoeM3rhwl34EanFpiH5ZHVOsB4R9NKQb][annotated]]), [[https://canvas.anu.edu.au/files/829740/download?download_frd=1&verifier=7lRHEGl9V1CM3rdp0rgIueU2YXMqOTiHBcitLSjQ][Tuesday]] ([[https://canvas.anu.edu.au/files/832320/download?download_frd=1&verifier=3q1uUlFN6LbDOYRUc9aGvteJXSTmqhu7nARS8qmV][annotated]]), [[https://canvas.anu.edu.au/files/832317/download?download_frd=1&verifier=AiXNPnLnfWMCocCfR4LESOnBwd7NNGGKLa4EGe2i][Wednesday]] ([[https://canvas.anu.edu.au/files/834040/download?download_frd=1&verifier=q44wA30BpEZ8or2mE80Phwe8UZci0rTL2ZF1G1Qx][annotated]])
- Week 8
  - Watch: [[https://canvas.anu.edu.au/files/824324/][Non-determinisic finite automata]], [[https://canvas.anu.edu.au/files/824353/][NFA-to-DFA]], [[https://canvas.anu.edu.au/files/824365/][NFA-to-regex]]
  - Read: /Nondeterministic finite automata, NFA to DFA, Regular expressions to finite automata/ from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/834038/download?download_frd=1&verifier=JcJGFhWwQc4AQNBk6Jbx5TWzMAwycfvJ73hlBjf1][Assignment 7 (due 26 Sep)]] ([[https://canvas.anu.edu.au/files/873289/download?download_frd=1&verifier=CiRDUJ25oOKKYlATOalkFwXfUlvsz7FdF1KvA0TY][solutions]]), [[https://canvas.anu.edu.au/files/844087/download?download_frd=1&verifier=EkBQbjevX17L6q1Q0mF2wCbE779GIP7ytJG2ojUv][Worksheet 7]] ([[https://canvas.anu.edu.au/files/857941/download?download_frd=1&verifier=BuSP6xHFqNTxcT1FM1B9t5hFApsNGIKaGDDUDFpw][solutions]]), [[https://canvas.anu.edu.au/files/866148/download?download_frd=1&verifier=yEVyjyFHeBSCDBgUOidjIOuafYIYOQTqZeT5K6LT][Quiz 7]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/842948/download?download_frd=1&verifier=wtXOpD6esx9JhlpS3nn8NCNcfFM1RJzWIktm6Xi0][Monday]] ([[https://canvas.anu.edu.au/files/845743/download?download_frd=1&verifier=vI8l1pLegYpYOa2gzdnOC0rfS2wWQxu4qCuuIdte][annotated]]), [[https://canvas.anu.edu.au/files/845349/download?download_frd=1&verifier=Kpxpe26IUOgkPif5ujA5KwoCLamRmTjH97igAYe1][Tuesday]] ([[https://canvas.anu.edu.au/files/847721/download?download_frd=1&verifier=Sk95EWhgHaQkJIfa1Wq681BbWqQk2bYHxzFZAPPO][annotated]]), [[https://canvas.anu.edu.au/files/847716/download?download_frd=1&verifier=fG4cAh5n8Jcn6OWrD6D62MNf26Uk1OXF1j6UMPyE][Wednesday]] ([[https://canvas.anu.edu.au/files/857883/download?download_frd=1&verifier=WIbiddnh3JLmUPM0K8LIgaDfg2cs65fnfKdPDRhk][annotated]])
- Week 9
  - Watch: [[https://canvas.anu.edu.au/files/842902/][Regex to NFA]], [[https://canvas.anu.edu.au/files/842904/][Pumping lemma]]
  - Read: /Converting finite automata to regular expressions, Non-regular languages/ from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/848684/download?download_frd=1&verifier=mymSd69dVwC8VI9x0UjiFBuxZkzTjXq6VHIRLYwS][Assignment 8]] ([[https://canvas.anu.edu.au/files/1253165/download?download_frd=1&verifier=yXDhEeO2kLNoAPavhKYi1JAERQ4nWDYoi4iNuEj2][solutions]]), [[https://canvas.anu.edu.au/files/859051/download?download_frd=1&verifier=8Q8G0uUTuIF3HHy8S6aYTrjkWbSbugHUKRey340i][Worksheet 8]] ([[https://canvas.anu.edu.au/files/1193041/download?download_frd=1&verifier=BDAQUW58Ri7F3lXnvxmt2S6AnqKRf8GvtQPhGyCW][solutions]]), [[https://canvas.anu.edu.au/files/1193063/download?download_frd=1&verifier=2jjBzNfXRx1mDfFXAq0PmNgeE1S7kWX5d5pb2ZqB][Quiz 8]]
  - Review: Lecture notes [[https://canvas.anu.edu.au/files/857878/download?download_frd=1&verifier=paUjAn8uRVPyExe5TbAlmKaJIlHbqP2atCLcvBok][Monday]] ([[https://canvas.anu.edu.au/files/860481/download?download_frd=1&verifier=FfcGbZs3CBxzO2PGEttmG3PqM41XSNOZqMzLphOx][annotated]]), [[https://canvas.anu.edu.au/files/860478/download?download_frd=1&verifier=nBjuw1zQXI4atcQ2LPX4Eve60LasTYmEp13kxIUj][Tuesday]] ([[https://canvas.anu.edu.au/files/865816/download?download_frd=1&verifier=q422a8O2faXx1vEpqTxzQ69Vf125YqTn3N7GZy5W][annotated]]), [[https://canvas.anu.edu.au/files/865815/download?download_frd=1&verifier=sZRztvFdKOyBZc6oAkdzTR9xzl8uBskcF1AKrgxI][Wednesday]] ([[https://canvas.anu.edu.au/files/1197705/download?download_frd=1&verifier=DKGrbU2tOhqP9lIcMRh4IFkGq1ujs95SyGJ8f6EG][annotated]])
- Week 10
  - Watch: [[https://canvas.anu.edu.au/files/857795/][Games]], [[https://canvas.anu.edu.au/files/857804/][Winning strategies]]
  - Read: /Combinatorial games/ (introduction, strategic labelling, beginning of Nim) from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/870410/download?download_frd=1&verifier=GbVIq9ttu8I6i7tUyfvcuyJvgOsr7i43v3XtT0QR][Assignment 9 (due 10 Oct)]] ([[https://canvas.anu.edu.au/files/1253166/download?download_frd=1&verifier=78p4RQterGdWob2erusOquWO2sYDrGj1w5AZIWEh][solutions]]), [[https://canvas.anu.edu.au/files/1193018/download?download_frd=1&verifier=Fre2KybJXDQwHG7xRSxbI4dhdej5vE1xCFQZEtQU][Worksheet 9]] ([[https://canvas.anu.edu.au/files/1237040/download?download_frd=1&verifier=d5tQtEhqHdUZk1xBLoq5UQDI04e13KJgnvnGKMKS][solutions]]), [[https://canvas.anu.edu.au/files/1253158/download?download_frd=1&verifier=I6LPYJw2WrmoqU9P39jcQQk6cELBQUpKoEI9zv4W][Quiz 9]]
  - Review: Lecture notes [[https://canvas.anu.edu.au/files/1197681/download?download_frd=1&verifier=wPNRjoYWfQ90yzlwCwAGwHePa3WWVbjtqqvL1CKu][Tuesday]] ([[https://canvas.anu.edu.au/files/1234687/download?download_frd=1&verifier=Ks5NPExszg7ncAJf9ewq87x46kH2JqWqoHsg2NiL][annotated]]), [[https://canvas.anu.edu.au/files/1203429/download?download_frd=1&verifier=DW2UglMEQL6sO0Bs4F3eODeNW5fsaLS9Q2Xn1nb0][Wednesday]] ([[https://canvas.anu.edu.au/files/1234690/download?download_frd=1&verifier=HVVj3nsXtPaQCGEVrxp7UMyNGMh86GgpZx6UQ293][annotated]])
- Week 11
  - Watch: [[https://canvas.anu.edu.au/files/1192864/][Nim]], [[https://canvas.anu.edu.au/files/1192874/][Stable equivalence]]
  - Read: /Nim, Game sum, Stable equivalence/ from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/1234680/download?download_frd=1&verifier=hKdi5heHolUL8ojRUeeI0KvHddX4Kc022QeE9qns][Assignment 10 (due 17 Oct)]] ([[https://canvas.anu.edu.au/files/1285505/download?download_frd=1&verifier=O9uwD0E7kIpYQ7bsqn4zgetOD72FsvOnTQQJopHT][solutions]]),  [[https://canvas.anu.edu.au/files/1237035/download?download_frd=1&verifier=U7pZ7aIdDkAmqEpAyV1nb0EIK4P9stSaiRVIAhVP][Worksheet 10]] ([[https://canvas.anu.edu.au/files/1253160/download?download_frd=1&verifier=KAEIUuu29GLKGm09hRoWStdoSa88qcGgftvfeZds][solutions]]), [[https://canvas.anu.edu.au/files/1285498/download?download_frd=1&verifier=qdedF6OxMmOunNfrZk2WOHZpeXjqxFKuydcUDEov][Quiz 10]]
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/1234714/download?download_frd=1&verifier=jkRkqQknmEyL2PEkgXFH3FXbR981pCerSasaBB94][Monday]] ([[https://canvas.anu.edu.au/files/1240324/download?download_frd=1&verifier=wraKuB4iCL6vwLq6WtcowhwZw8vui7CBnVAXqoQk][annotated]]), [[https://canvas.anu.edu.au/files/1238150/download?download_frd=1&verifier=2jOaZTXS7trxziz9VeKxNJZodWXOsxp3Esbip4C1][Tuesday]] ([[https://canvas.anu.edu.au/files/1240323/download?download_frd=1&verifier=KAiWED3lVHMkcLDN4z2XmbSQmnbAucrKA4N8Szll][annotated]]), [[https://canvas.anu.edu.au/files/1240321/download?download_frd=1&verifier=q88GGCxbn2R29Z1TMh6T9mJWD3yDHZTqduojZT8t][Wednesday]] ([[https://canvas.anu.edu.au/files/1249504/download?download_frd=1&verifier=G0cdK4KdzposoO0NfVnO0tj1B3ndPRWAVq5ZUrjX][annotated]])
- Week 12
  - Watch: [[https://canvas.anu.edu.au/files/1234702/][Grundy labeling: what?]], [[https://canvas.anu.edu.au/files/1234703/][Grundy labeling: why?]]
  - Read: /Grundy labeling/ from [[https://canvas.anu.edu.au/files/715877/][the book]].
  - Solve: [[https://canvas.anu.edu.au/files/1242935/download?download_frd=1&verifier=Ipf81ETJH7KLDTXvtOwAGUQ97ziSgx8r6cMutZM8][Assignment 11 (due 24 Oct)]], [[https://canvas.anu.edu.au/files/1275923/download?download_frd=1&verifier=rrx48Ktcal3nY1xxioKjgRGhHONugIgrRtREjAfH][Worksheet 11]] ([[https://canvas.anu.edu.au/files/1317954/download?download_frd=1&verifier=bydsW41CpSYPc047AAgkrt16kXBTflxSqV9FEVDV][solutions]])
  - Review: Lecture slides [[https://canvas.anu.edu.au/files/1251544/download?download_frd=1&verifier=6UHcbjMN0TpaZAaYXc8h7Kn5PiRZk3hBQnOQw6GJ][Monday]], [[https://canvas.anu.edu.au/files/1254914/download?download_frd=1&verifier=qwWhEbbHIgn4U7ZFUN4jthzS11VLQAQg3BiCKrRz][Tuesday]]
