content/teaching/2025_games_graphs_and_machines/index.org
* Academic integrity policy
If you are ever unsure about whether something is or is not allowed, ask me for clarification.
** Collaboration
You are welcome to collaborate with other students, but the submitted work should be your own.

What this means is the following.
You will typically work in two phases on assignments.

- The solving phase :: trying to find the answers to the questions.
     In this phase, you should first think about the problem on your own.  After an honest effort, you are welcome---and encouraged---to work with other students.  Having thought about the problem on their own, everyone in a collaboration will have something to contribute.  Once you know how to solve the problem, move on to the next phase.

     On your solution, you must acknowledge the sources of your collaboration. 
     Not doing so is a violation of the academic integrity policy.
     For example, write "On this assignment, I collaborated with X, Y, and Z."
     You need not cite me, any of the demonstrators, or the staff from MSI drop-in sessions.

- The write-up phase :: writing up your solutions for submission.
     You must do this entirely by yourself.  Work alone when you are writing.  If you copy parts of someone else's solutions, you are violating the academic integrity policy.  If you get stuck while writing, you are welcome to go back to the solving phase, get help, and return to writing (by yourself).

In addition to your peers, you have many other sources for help in the solving phase:
1. Office hours
2. Demonstrator consultaion hours
3. [[https://maths.anu.edu.au/current-students/student-support][MSI drop-in sessions]]

Submitting solutions that are not your own (for example, written by a friend or sourced from a solutions provider like =CourseHero= or =Chegg=) is a violation of the academic integrity policy.
** Use of computer generated content
If any part of your submission is computer generated:
1. you must clearly mark it; and
2. it must have been generated by code that you wrote on your own.
   (I may ask you to provide and explain the code).

Submitting content generated by automatic text generators (=ChatGPT=, =DeepSeek=, or similar) is a violation of the academic integrity policy.

The goal of the assignments is to develop and test your understanding of the material.
Using pre-fabricated code does not help in this.
** Late submission
No late submissions are allowed unless you ask for an extension in writing (email) at least 24 hours before the due date.  I will release answers to assignments 2 to 3 working days after the due date.  The maximum extension I can give is until answers are released.  For extensions beyond this period, please use the [[https://www.anu.edu.au/students/program-administration/assessments-exams/extenuating-circumstances-application][Extentuating Circumstances Application]].
