teaching/2025_games_graphs_and_machines/index.html
<div id="outline-container-orgb007d74" class="outline-2">
<h2 id="orgb007d74">Academic integrity policy</h2>
<div class="outline-text-2" id="text-orgb007d74">
<p>
If you are ever unsure about whether something is or is not allowed, ask me for clarification.
</p>
</div>
<div id="outline-container-org5769a3d" class="outline-3">
<h3 id="org5769a3d">Collaboration</h3>
<div class="outline-text-3" id="text-org5769a3d">
<p>
You are welcome to collaborate with other students, but the submitted work should be your own.
</p>

<p>
What this means is the following.
You will typically work in two phases on assignments.
</p>

<dl class="org-dl">
<dt>The solving phase</dt><dd><p>
trying to find the answers to the questions.
In this phase, you should first think about the problem on your own.  After an honest effort, you are welcome&#x2014;and encouraged&#x2014;to work with other students.  Having thought about the problem on their own, everyone in a collaboration will have something to contribute.  Once you know how to solve the problem, move on to the next phase.
</p>

<p>
On your solution, you must acknowledge the sources of your collaboration. 
Not doing so is a violation of the academic integrity policy.
For example, write &ldquo;On this assignment, I collaborated with X, Y, and Z.&rdquo;
You need not cite me, any of the demonstrators, or the staff from MSI drop-in sessions.
</p></dd>

<dt>The write-up phase</dt><dd>writing up your solutions for submission.
You must do this entirely by yourself.  Work alone when you are writing.  If you copy parts of someone else&rsquo;s solutions, you are violating the academic integrity policy.  If you get stuck while writing, you are welcome to go back to the solving phase, get help, and return to writing (by yourself).</dd>
</dl>

<p>
In addition to your peers, you have many other sources for help in the solving phase:
</p>
<ol class="org-ol">
<li>Office hours</li>
<li>Demonstrator consultaion hours</li>
<li><a href="https://maths.anu.edu.au/current-students/student-support">MSI drop-in sessions</a></li>
</ol>

<p>
Submitting solutions that are not your own (for example, written by a friend or sourced from a solutions provider like <code>CourseHero</code> or <code>Chegg</code>) is a violation of the academic integrity policy.
</p>
</div>
</div>
<div id="outline-container-org7a52a2e" class="outline-3">
<h3 id="org7a52a2e">Use of computer generated content</h3>
<div class="outline-text-3" id="text-org7a52a2e">
<p>
If any part of your submission is computer generated:
</p>
<ol class="org-ol">
<li>you must clearly mark it; and</li>
<li>it must have been generated by code that you wrote on your own.
(I may ask you to provide and explain the code).</li>
</ol>

<p>
Submitting content generated by automatic text generators (<code>ChatGPT</code>, <code>DeepSeek</code>, or similar) is a violation of the academic integrity policy.
</p>

<p>
The goal of the assignments is to develop and test your understanding of the material.
Using pre-fabricated code does not help in this.
</p>
</div>
</div>
<div id="outline-container-orga47346c" class="outline-3">
<h3 id="orga47346c">Late submission</h3>
<div class="outline-text-3" id="text-orga47346c">
<p>
No late submissions are allowed unless you ask for an extension in writing (email) at least 24 hours before the due date.  I will release answers to assignments 2 to 3 working days after the due date.  The maximum extension I can give is until answers are released.  For extensions beyond this period, please use the <a href="https://www.anu.edu.au/students/program-administration/assessments-exams/extenuating-circumstances-application">Extentuating Circumstances Application</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15).  Last modified: 2026-04-25 Sat 12:26.  <a href="https://github.com/deopurkar/deopurkar.github.io">Source</a>
</div>
</body>
</html>
